Revit 2024 API
StairsRunType.IsSlanted Property
 True if risers will be slanted, false if they will be straight.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsSlanted { get; set; }
Visual Basic
Public Property IsSlanted As Boolean
	Get
	Set
Visual C++
public:
property bool IsSlanted {
	bool get ();
	void set (bool value);
}
See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace